Repository: Jefferson49/webtrees-API
Catalog: resources/lang/*.po
Languages: ca, de, es, nl

source: Sucessfully created new private/public keys.
ca: La nova clau privada/pública s'ha generat amb èxit.
de: Der neue private/öffentliche Schlüssel wurde erfolgreich erzeugt.
es: Se han creado correctamente nuevas claves privadas/públicas.
nl: Nieuwe private/publieke sleutels aangemaakt.

source: Create new private/public keys
ca: Crea noves claus privades/públiques
de: Neuen privaten/öffentlichen Schlüssel erzeugen
es: Crear nuevas claves privadas/públicas
nl: Nieuwe private/publieke sleutels aanmaken

source: The client does not have the requested scopes
ca: El client no té els permisos sol·licitats
de: Der Client verfügt nicht über die angeforderten Berechtigungen (Scopes)
es: El cliente no tiene los permisos solicitados
nl: De client heeft niet de gevraagde scopes

source: Sucessfully created new access token.
ca: S'ha creat amb èxit un nou token d'accés.
de: Das neue Zugriffstoken wurde erfolgreich erzeugt.
es: Se ha creado correctamente un nuevo token de acceso.
nl: Nieuw toegangstoken aangemaakt.

source: Create Access Token
ca: Crea un tokén d'accés
de: Zugriffstoken erzeugen
es: Crear token de acceso
nl: Toegangstoken aanmaken

source: Could not delete client, because it has active access tokens assigned.
ca: No s'ha pogut suprimir el client perquè té tokens d'accés actius assignats.
de: Der Client konnte nicht gelöscht werden, da ihm aktive Zugriffstoken zugewiesen sind.
es: No se ha podido eliminar el cliente, ya que tiene tokens de acceso activos asignados.
nl: Client kon niet worden verwijderd, omdat er actieve toegangstokens aan gekoppeld zijn.

source: All fields are required. Client data rejected, because one of the provided client fields is empty.
ca: Tots els camps són obligatoris. Les dades del client han estat rebutjades perquè un dels camps proporcionats està buit.
de: Alle Felder sind erforderlich. Die Client-Daten wurden abgelehnt, weil eines der angezeigten Client-Felder leer ist.
es: Todos los campos son obligatorios. Datos del cliente rechazados, ya que uno de los campos del cliente proporcionados está vacío.
nl: Alle velden zijn verplicht. Clientgegevens geweigerd omdat één van de velden leeg is.

source: Client successfully added or changed.
ca: El client s'ha afegit o modificat correctament.
de: Client erfolgreich hinzugefügt oder geändert.
es: Cliente añadido o modificado correctamente.
nl: Client toegevoegd of gewijzigd.

source: Could not add client, because the client identifier already exists.
ca: No s'ha pogut afegir el client, perquè l'identificador del client ja existeix.
de: Der Client konnte nicht hinzugefügt werden, weil der Client-Kenner bereits existiert.
es: No se ha podido añadir el cliente, ya que el identificador del cliente ya existe.
nl: Client kon niet worden toegevoegd, omdat de client-identifier al bestaat.

source: Edit Client
ca: Edita Client
de: Client ändern
es: Editar Cliente
nl: Client bewerken

source: 15 minutes
ca: 15 Minuts
de: 15 Minuten
es: 15 Minutos
nl: 15 minuten

source: 1 hour
ca: 1 Hora
de: 1 Stunde
es: 1 Hora
nl: 1 uur

source: 1 month
ca: 1 Mes
de: 1 Monat
es: 1 Mes
nl: 1 maand

source: 1 year
ca: 1 Any
de: 1 Jahr
es: 1 Año
nl: 1 jaar

source: A custom module to provide an API for webtrees.
ca: Un mòdul personalitzat per proporcionar una API per a webtrees.
de: Ein Erweiterungsmodul, welches eine API-Schnittstelle für webtrees bereitstellt.
es: Un módulo personalizado para proporcionar una API para webtrees.
nl: Een aangepaste module die een API voor webtrees aanbiedt.

source: The preferences for the module "%s" were updated.
ca: Les preferències del mòdul "%s" s'han actualitzat.
de: Die Einstellungen für das Modul "%s" wurden aktualisiert.
es: Se han actualizado las preferencias del módulo «%s».
nl: De voorkeuren voor de module "%s" zijn bijgewerkt.

source: Could not change path to private/public keys. The directory provided in the path to private/public keys does not exist.
ca: No s'ha pogut canviar el camí de les claus privades/públiques. El directori indicat en el camí de les claus privades/públiques no existeix.
de: Der Pfad zum privaten/öffentlichen Schlüssel konnte nicht geändert werden. Das im Pfad zum privaten/öffentlichen Schlüssel angegebene Verzeichnis existiert nicht.
es: No se ha podido cambiar la ruta a las claves privadas/públicas. El directorio proporcionado en la ruta a las claves privadas/públicas no existe.
nl: Pad naar private/publieke sleutels kon niet worden gewijzigd. De opgegeven map bestaat niet.

source: Failed to create directory for keys
ca: Ha fallat la creació del directori per a les claus
de: Die Erzeugung des Verzeichnisses für die Schlüssel ist fehlgeschlagen
es: No se ha podido crear el directorio para las claves
nl: Map voor sleutels kon niet worden aangemaakt

source: No access to private/public keys directory
ca: Sense accés al directori de claus privades/públiques
de: Kein Zugriff auf das Verzeichnis mit dem privaten/öffentlichen Schlüssel
es: No hay acceso al directorio de claves privadas/públicas
nl: Geen toegang tot de map met private/publieke sleutels

source: Private key file does not exist
ca: El fitxer de la clau privada no existeix
de: Die Datei für den privaten Schlüssel existiert nicht
es: El archivo de clave privada no existe.
nl: Bestand met privésleutel bestaat niet

source: Public key file does not exist
ca: El fitxer de clau pública no existeix
de: Die Datei für den öffentlichen Schlüssel existiert nicht
es: El archivo de clave pública no existe.
nl: Bestand met publieke sleutel bestaat niet

source: Cannot create private/public keys, because the PHP extension openssl is not available. Please install the PHP extension or create public/private keys manually, e.g. by using OpenSSL on the command line.
ca: No es poden crear claus privades/públiques perquè l'extensió OpenSSL de PHP no està disponible. Si us plau, instal·leu l'extensió OpenSSL de PHP o creeu manualment les claus públiques/privades, per exemple utilitzant OpenSSL a la línia d'ordres.
de: Es konnte kein privater/öffentlicher Schlüssel erstellt werden, da die PHP-Erweiterung OpenSSL nicht verfügbar ist. Bitte installieren Sie die PHP-Erweiterung oder erstellen Sie den öffentlichen/privaten Schlüssel manuell, z. B. mit OpenSSL über die Kommandozeile.
es: No se pueden crear claves privadas/públicas porque la extensión PHP OpenSSL no está disponible. Instale la extensión PHP o cree claves públicas/privadas manualmente, por ejemplo, utilizando OpenSSL en la línea de comandos.
nl: Private/publieke sleutels kunnen niet worden aangemaakt, omdat de PHP‑extensie openssl niet beschikbaar is. Installeer de PHP‑extensie of maak de private/publieke sleutels handmatig aan, bijvoorbeeld met OpenSSL via de commandoregel.

source: Failed to generate private/public keys
ca: Ha fallat la generació de claus privades/públiques
de: Die Erzeugung des privaten/öffentlichen Schlüssels ist fehlgeschlagen
es: No se han podido generar las claves privadas/públicas
nl: Private/publieke sleutels konden niet worden gegenereerd

source: Please create public/private keys manually, e.g. by using OpenSSL on the command line. Put the keys into the keys path, which is defined in the module settings.
ca: Si us plau, creeu manualment les claus públiques i privades, per exemple utilitzant OpenSSL a la línia d'ordres. Col·loqueu les claus al camí de claus, que està definit a la configuració del mòdul.
de: Bitte erstellen Sie die öffentlichen/privaten Schlüssel manuell, z. B. mit OpenSSL über die Kommandozeile. Speichern Sie die Schlüssel in das Schlüsselverzeichnis, welches in den Moduleinstellungen definiert ist.
es: Cree las claves públicas/privadas manualmente, por ejemplo, utilizando OpenSSL en la línea de comandos. Coloque las claves en la ruta de claves, que se define en la configuración del módulo.
nl: Maak de private/publieke sleutels handmatig aan, bijvoorbeeld met behulp van OpenSSL via de commandoregel. Plaats de sleutels in het sleutelpad dat is gedefinieerd in de module‑instellingen.

source: Failed to write key to the following path
ca: Ha fallat l'escriptura de la clau a la ruta següent
de: Das Abspeichern der Schlüsseldatei in den folgenden Pfad ist fehlgeschlagen
es: No se ha podido escribir la clave en la siguiente ruta
nl: Sleutel kon niet worden weggeschreven naar het volgende pad

source: Error during initialization of the OAuth2 server
ca: Error durant la inicialització del servidor OAuth2
de: Fehler bei der Initialisierung des OAuth2-Servers
es: Error durante la inicialización del servidor OAuth2
nl: Fout tijdens het initialiseren van de OAuth2‑server

source: Client Identifier
ca: Identificador de client
de: Client-Kenner
es: Identificador de cliente

source: Client Secret
ca: Secret del Client
de: Client-Geheimschlüssel
es: Secreto de cliente
nl: Clientgeheim

source: New Client Secret
ca: Nou Secret del Client
de: Neuer Client-Geheimschlüssel
es: Nuevo secreto de cliente
nl: Nieuw clientgeheim

source: Create new client secret
ca: Genera un nou Secret de Client
de: Neuen Client-Geheimschlüssel erzeugen
es: Crear nuevo secreto de cliente
nl: Nieuw clientgeheim aanmaken

source: If this option is selected, a new client secret will be created.
ca: Quan es selecciona aquesta opció, es crea una nova clau secreta de client.
de: Bei Auswahl dieser Option ausgewählt, wird ein neuer Client-Geheimschlüssel erstellt.
es: Si se selecciona esta opción, se creará un nuevo secreto de cliente.
nl: Als deze optie is geselecteerd, wordt een nieuw clientgeheim aangemaakt.

source: Client Name
ca: Nom del Client
es: Nombre del Cliente
nl: Clientnaam

source: Scopes
ca: Permisos
es: Permisos

source: Technical User
ca: Usuari tècnic
de: Technischer Benutzer
es: Usuario tecnico
nl: Technische gebruiker

source: Please confirm: Existing private/public keys will be deleted and replaced by new keys. Existing access tokens will be deleted, because they will not work with newly created keys.
ca: Confirmeu: les claus privades/públiques existents s'eliminaran i es substituiran per noves claus. Els tokens d'accés existents s'eliminaran, perquè no funcionaran amb les claus de nova creació.
de: Bitte bestätigen Sie: Vorhandene private/öffentliche Schlüssel werden gelöscht und durch neue ersetzt. Vorhandene Zugriffstoken werden ebenfalls gelöscht, da sie mit den neu erstellten Schlüsseln nicht kompatibel sind.
es: Confirme: Las claves privadas/públicas existentes se eliminarán y se sustituirán por nuevas claves. Los tokens de acceso existentes se eliminarán, ya que no funcionarán con las claves recién creadas.
nl: Bevestig: bestaande private/publieke sleutels worden verwijderd en vervangen door nieuwe sleutels. Bestaande toegangstokens worden verwijderd, omdat ze niet werken met nieuw aangemaakte sleutels.

source: Edit Client Credentials
ca: Edita les credencials del Client
de: Client-Geheimschlüssel ändern
es: Editar credenciales de cliente
nl: Client‑credentials bewerken

source: Please copy the newly created client secret to a suitable and secure place in your local environment. If you do not save it, it cannot be shown and copied once again.
ca: Si us plau, copieu el Secret del Client acabat de crear en un lloc adequat i segur del vostre entorn local. Si no l'enregistreu, no es podrà tornar a mostrar ni a copiar.
de: Bitte kopieren Sie den neu erstellten Client-Geheimschlüssel an einen geeigneten und sicheren Ort in Ihrer lokalen Umgebung. Wenn Sie ihn nicht speichern, kann er nicht erneut angezeigt und kopiert werden.
es: Copie el secreto de cliente recién creado en un lugar adecuado y seguro de su entorno local. Si no lo guarda, no podrá volver a mostrarlo ni copiarlo.
nl: Kopieer het nieuw aangemaakte clientgeheim naar een geschikte en veilige locatie in je eigen omgeving. Als u het niet opslaat, kan het later niet opnieuw worden getoond of gekopieerd.

source: Please copy the newly created acccess token to a suitable and secure place in your local environment. If you do not save it, it cannot be shown and copied once again.
ca: Si us plau, copieu el token d'accés acabat de crear en un lloc adequat i segur del vostre entorn local. Si no el deseu, no es podrà tornar a mostrar ni a copiar.
de: Bitte kopieren Sie das neu erstellte Zugriffstoken an einen geeigneten und sicheren Ort in Ihrer lokalen Umgebung. Wenn Sie es nicht speichern, kann es nicht erneut angezeigt und kopiert werden.
es: Copie el token de acceso recién creado en un lugar adecuado y seguro de su entorno local. Si no lo guarda, no podrá volver a mostrarlo ni copiarlo.
nl: Kopieer het nieuw aangemaakte toegangstoken naar een geschikte en veilige locatie in je eigen omgeving. Als u het niet opslaat, kan het later niet opnieuw worden getoond of gekopieerd.

source: Access Token
ca: Token d'accés
de: Zugriffstoken
es: Token de acceso
nl: Toegangstoken

source: Expiration Interval
ca: Interval de la caducitat
de: Ablaufzeitraum
es: Intervalo de caducidad
nl: Verloopinterval

source: Control panel
ca: Tauler de control
de: Verwaltung
es: Panel de control
nl: Controlepaneel

source: OAuth2 Server Settings
ca: Configuració del servidor OAuth2
de: Einstellungen für den OAuth2 Server
es: Configuración del servidor OAuth2
nl: OAuth2‑serverinstellingen

source: Currently, webtrees does not use the HTTPS protocol. It is highly recommended to use HTTPS in order to ensure the encryption of access tokens within API requests. HTTPS can be activated by changing "base_url" in the "config.ini.php". Currently, "base_url" does not start with "https://".
ca: Actualment, webtrees no utilitza el protocol HTTPS. Es recomana urgentment utilitzar HTTPS per garantir el xifratge dels tokens d'accés en les sol·licituds de l'API. Es pot activar HTTPS canviant "base_url" al fitxer "config.ini.php". Actualment, "base_url" no comença amb "https://".
de: Webtrees verwendet aktuell kein HTTPS-Protokoll. Es wird dringend empfohlen, HTTPS zu nutzen, um die Verschlüsselung von Zugriffstokens innerhalb von Remote-Anfragen sicherzustellen. HTTPS kann durch Ändern von "base_url" in der "config.ini.php" Datei geändert werden. Aktuell startet "base_url" nicht mit "https://".
es: Actualmente, webtrees no utiliza el protocolo HTTPS. Se recomienda encarecidamente utilizar HTTPS para garantizar el cifrado de los tokens de acceso en las solicitudes API. HTTPS se puede activar cambiando «base_url» en «config.ini.php». Actualmente, «base_url» no comienza por «https://».
nl: Momenteel gebruikt webtrees geen HTTPS‑protocol. Het wordt sterk aanbevolen HTTPS te gebruiken om toegangstokens binnen API‑verzoeken te versleutelen. HTTPS kan worden geactiveerd door base_url in config.ini.php aan te passen. De huidige base_url begint niet met https://.

source: Currently, the path for the private/public keys is not a sub-directory of the webtrees data folder. If the keys path lies within the webtrees installation, it is highly recommended to use the webtrees data folder or a sub-directory, because webtrees protects unauthorized access to this folder. If you choose a folder outside of the webtrees data folder, the keys might be unprotected against unauthorized access.
ca: Actualment, el camí de les claus privades/públiques no és un subdirectori de la carpeta de dades de webtrees. Si el camí de les claus es troba dins de la instal·lació de webtrees, es recomana molt utilitzar la carpeta de dades de webtrees o un subdirectori, perquè webtrees protegeix aquesta carpeta contra l'accés no autoritzat. Si trieu una carpeta fora de la carpeta de dades de webtrees, les claus podrien quedar desprotegides contra l'accés no autoritzat.
de: Derzeit befindet sich der Pfad für den privaten/öffentlichen Schlüssel nicht in einem Unterverzeichnis des webtrees-Datenordners. Wenn sich der Schlüsselpfad innerhalb der webtrees-Installation befindet, wird dringend empfohlen, den webtrees-Datenordner oder ein Unterverzeichnis zu verwenden, da webtrees diesen Ordner vor unbefugtem Zugriff schützt. Bei Wahl eines Ordners außerhalb des webtrees-Datenordners, sind die Schlüssel möglicherweise nicht vor unbefugtem Zugriff geschützt.
es: Actualmente, la ruta de las claves privadas/públicas no es un subdirectorio de la carpeta de datos de webtrees. Si la ruta de las claves se encuentra dentro de la instalación de webtrees, se recomienda encarecidamente utilizar la carpeta de datos de webtrees o un subdirectorio, ya que webtrees protege el acceso no autorizado a esta carpeta. Si elige una carpeta fuera de la carpeta de datos de webtrees, es posible que las claves no estén protegidas contra el acceso no autorizado.
nl: Momenteel is het pad voor de private/publieke sleutels geen submap van de webtrees‑datamap. Als het sleutelpad binnen de webtrees‑installatie ligt, wordt aanbevolen de gegevensmap of een submap daarvan te gebruiken, omdat webtrees deze map beschermt tegen ongeautoriseerde toegang. Als u een map buiten de gegevensmap kiest, kunnen de sleutels onbeschermd zijn tegen ongeautoriseerde toegang.

source: Path for private/public keys
ca: Ruta d'accés per a les claus privades/públiques
de: Pfad für privaten/öffentlichen Schlüssel
es: Ruta de acceso para claves privadas/públicas
nl: Pad voor private/publieke sleutels

source: Path to the private/public keys. If a path is used within the webtrees installation, it is highly recommended to use a path within the webtrees data folder, because webtrees protects unauthorized access to the data folder. The current settings (Control panel / Website preferences) for the webtrees root and data folder are:
ca: Ruta cap a les claus privades/públiques. Si s'utilitza una ruta dins la instal·lació de webtrees, es recomana molt fer servir una ruta dins la carpeta de dades de webtrees, perquè webtrees protegeix l'accés no autoritzat a la carpeta de dades. La configuració actual (Panell de control / Preferències del lloc web) per a la carpeta arrel i la carpeta de dades de webtrees són:
de: Pfad zum privaten/öffentlichen Schlüssel. Wenn ein Pfad innerhalb der webtrees-Installation verwendet wird, empfiehlt es sich dringend, einen Pfad innerhalb des webtrees-Datenordners zu verwenden, da webtrees den unbefugten Zugriff auf den Datenordner schützt. Die aktuellen Einstellungen (Systemsteuerung / Website-Einstellungen) für das webtrees-Basisverzeichnis und den Datenordner lauten:
es: Ruta a las claves privadas/públicas. Si se utiliza una ruta dentro de la instalación de webtrees, se recomienda encarecidamente utilizar una ruta dentro de la carpeta de datos de webtrees, ya que webtrees protege el acceso no autorizado a la carpeta de datos. La configuración actual (Panel de control / Preferencias del sitio web) para la raíz de webtrees y la carpeta de datos es:
nl: Pad naar de private/publieke sleutels. Als een pad binnen de webtrees‑installatie wordt gebruikt, wordt aanbevolen een pad binnen de gegevensmap te gebruiken, omdat webtrees deze map beschermt tegen ongeautoriseerde toegang. De huidige instellingen (Controlepaneel / Websitevoorkeuren) voor de webtrees‑hoofdmap en gegevensmap zijn:

source: webtrees root folder
ca: directori arrel de webtrees
de: webtrees Basis-Verzeichnis
es: Carpeta raíz de webtrees
nl: webtrees‑hoofdmap

source: webtrees data folder
ca: Carpeta de dades de webtrees
de: webtrees Daten-Verzeichnis
es: Carpeta de datos de webtrees
nl: webtrees‑gegevensmap

source: webtrees data folder (relative path)
ca: directori de dades de webtrees (ruta relativa)
de: webtrees Daten-Verzeichnis (relativer Pfad)
es: Carpeta de datos de webtrees (ruta relativa)
nl: webtrees‑gegevensmap (relatief pad)

source: webtrees data folder (setting in the control panel)
ca: Carpeta de dades de webtrees (configuració al panell de control)
de: webtrees Daten-Verzeichnis (Einstellung in der Verwaltung)
es: Carpeta de datos de webtrees (configuración en el panel de control)
nl: webtrees‑gegevensmap (instelling in het controlepaneel)

source: Private key
ca: Clau Privada
de: Privater Schlüssel
es: Clave Privada
nl: Privésleutel

source: Public key
ca: Clau Pública
de: Öffentlicher Schlüssel
es: Clave Pública
nl: Publieke sleutel

source: Pretty URL
ca: URL bonica
es: URL bonita
nl: Mooie URL

source: OAuth2 Access Token URL
ca: URL del token d'accés OAuth2
de: OAuth2 Zugriffstoken URL
es: URL del token de acceso OAuth2
nl: OAuth2‑toegangstoken‑URL

source: Access Token URL
ca: URL del token d'accés
de: Zugriffstoken-URL
es: URL del token de acceso
nl: Toegangstoken‑URL

source: API Test
es: Prueba de API

source: Select Technical User
ca: Usuari Tècnic Seleccionat
de: Technischen Benutzer auswählen
es: Seleccionar usuario técnico
nl: Technische gebruiker selecteren

source: With the selected technical user, the access rights to trees in webtrees are specified within API calls. For a detailed description of technical users, please refer to the related chapter below.
ca: Amb l'usuari tècnic seleccionat, els drets d'accés als arbres de webtrees s'especifiquen dins de les crides a l'API. Per a una descripció detallada dels usuaris tècnics, consulteu el capítol corresponent més avall.
de: Durch Auswahl des technischen Benutzers werden die Stammbäume-Zugriffsrechte in webtrees für API-Aufrufe festgelegt. Eine detaillierte Beschreibung der technischen Benutzer finden Sie im entsprechenden Kapitel weiter unten.
es: Con el usuario técnico seleccionado, los derechos de acceso a los árboles en Webtrees se especifican dentro de las llamadas API. Para obtener una descripción detallada de los usuarios técnicos, consulte el capítulo relacionado a continuación.
nl: Met de geselecteerde technische gebruiker worden de toegangsrechten tot stambomen in webtrees gespecificeerd binnen API-aanroepen. Voor een uitgebreide beschrijving van technische gebruikers verwijzen wij u naar het onderstaande hoofdstuk.

source: Test webtrees API
ca: Prova de l'API de Webtrees
de: webtrees API testen
es: Probar la API de webtrees
nl: webtrees‑API testen

source: The API can only be tested with "pretty" URLs enabled. Check the <a href="https://webtrees.net/faq/urls/" target="_blank">webtrees documentation</a> about how to enable "pretty" URLs.
ca: L'API només es pot provar amb les URL "boniques" habilitades. Consulteu la <a href="https://webtrees.net/faq/urls/" target="_blank">documentació de webtrees sobre com habilitar les URL "bonica".
de: Die API kann nur mit aktivierten "pretty" URLs getestet werden. Informationen zum Aktivieren von "pretty" URLs finden Sie in der <a href="https://webtrees.net/faq/urls/" target="_blank">webtrees-Dokumentation</a>.
es: La API solo se puede probar con las URL «bonitas» habilitadas. Consulte la <a href="https://webtrees.net/faq/urls/" target="_blank">documentación de webtrees</a> para saber cómo habilitar las URL «bonitas».
nl: De API kan alleen worden getest als "mooie" URLs zijn ingeschakeld. Raadpleeg de <a href="https://webtrees.net/faq/urls/" target="_blank">webtrees‑documentatie</a> voor informatie over het inschakelen van "mooie" URLs.

source: Client Credentials
ca: Credencials del Client
de: Client-Daten
es: Credenciales del Cliente

source: Client has tokens assigned
ca: El Client té tokens assignats
de: Client hat zugeordnete Tokens
es: El cliente tiene tokens asignados
nl: Aan deze client zijn toegangstokens gekoppeld

source: Create access token
ca: Crea un token d'accés
de: Zugriffstoken erzeugen
es: Crear token de acceso
nl: Toegangstoken aanmaken

source: Add client
ca: Afegeix Client
de: Client hinzufügen
es: Añadir Cliente
nl: Client toevoegen

source: Access Tokens
ca: Tokens d'accés
de: Zugriffstoken
es: Tokens de acceso
nl: Toegangstokens
