Repository: Jefferson49/webtrees-API
Catalog: resources/lang/*.po
Languages: ca, de, es, nl

source: Currently, the following access tokens are active, i.e. not expired yet.
ca: Actualment, els següents tokens d'accés estan actius, és a dir, encara no han caducat.
de: Aktuell sind die folgenden Zugriffstoken aktiv, d.h. noch nicht abgelaufen.
es: Actualmente, los siguientes tokens de acceso están activos, es decir, aún no han caducado.
nl: Momenteel zijn de volgende toegangstokens actief, dus nog niet verlopen.

source: Expiration Date
ca: Data de caducitat
de: Ablaufdatum
es: Fecha de caducidad
nl: Vervaldatum

source: Created with
ca: Creat amb
de: Erzeugt mit
es: Creado con
nl: Aangemaakt met

source: Revoked
ca: Revocat
de: Widerrufen
es: Revocado
nl: Ingetrokken

source: Revoke
ca: Revocar
de: Widerrufen
es: Revocar
nl: Intrekken

source: Added in the module settings
ca: Afegeix-ho a la configuració del mòdul
de: In den Modul-Einstellungen hinzugefügt
es: Añadido en la configuración del módulo
nl: Toegevoegd in de module‑instellingen

source: Token request using client credentials
ca: Sol·licitud de token amb credencials del client
de: Token-Anforderung unter Verwendung von Client-Daten
es: Solicitud de token utilizando credenciales de cliente
nl: Tokenaanvraag met behulp van client‑credentials

source: Explanation of Technical Users (to define API/MCP access rights)
ca: Explicació d'usuaris tècnics (per definir els drets d'accés a l'API/MCP)
de: Erläuterung zum technischen Benutzer (für die Festlegung der API/MCP-Zugriffsrechte)
es: Explicación de usuarios técnicos (para definir derechos de acceso a API/MCP)
nl: Uitleg over technische gebruikers (om API/MCP-toegangsrechten te definiëren)

source: By selecting a (technical) user, the access rights for API/MCP requests can be specified. Any tree data requested with API/MCP is limited to the access rights of the specified (technical) user.
ca: En seleccionar un usuari (tècnic), es poden especificar els drets d'accés per a les sol·licituds d'API/MCP. Qualsevol dada de l'arbre sol·licitada amb API/MCP està limitada als drets d'accés de l'usuari (tècnic) especificat.
de: Durch die Auswahl eines (technischen) Benutzers lassen sich die Zugriffsrechte für API/MCP-Anfragen festlegen. Alle über API/MCP angeforderten Stammbaumdaten sind auf die Zugriffsrechte des angegebenen (technischen) Benutzers beschränkt.
es: Al seleccionar un usuario (técnico), se pueden especificar los derechos de acceso para las solicitudes API/MCP. Cualquier dato de árbol solicitado con API/MCP está limitado a los derechos de acceso del usuario (técnico) especificado.
nl: Door een (technische) gebruiker te selecteren, kunnen de toegangsrechten voor API/MCP-verzoeken worden gespecificeerd. Alle stamboomgegevens die met API/MCP worden opgevraagd, zijn beperkt tot de toegangsrechten van de gespecificeerde (technische) gebruiker.

source: It is recommended to create a separate (technical) user, which is only used to define the API/MCP access rights. The maximum access role, wich is allowed for the (technical) user is limited to an "Editor". "Moderators" or "Administrators" are denied access during API/MCP requests.
ca: Es recomana crear un usuari (tècnic) separat, que només s'utilitza per definir els drets d'accés a l'API/MCP. El paper d'accés màxim permès per a aquest usuari (tècnic) està limitat a «Editor». S'ha denegat l'accés a «Moderadors» o «Administradors» durant les sol·licituds d'API/MCP.
de: Es wird empfohlen, einen separaten (technischen) Benutzer anzulegen, der ausschließlich zur Definition der API-/MCP-Zugriffsrechte dient. Die maximale Zugriffsrolle dieses (technischen) Benutzers ist auf „Bearbeiter“ beschränkt. „Moderatoren“ und „Administratoren“ dürfen für API-/MCP-Zugriffe nicht verwendet werden.
es: Se recomienda crear un usuario (técnico) independiente, que solo se utilice para definir los derechos de acceso a API/MCP. La función de acceso máxima permitida para el usuario (técnico) se limita a «Editor». A los «Moderadores» o «Administradores» se les deniega el acceso durante las solicitudes API/MCP.
nl: Het wordt aanbevolen om een aparte (technische) gebruiker aan te maken die uitsluitend wordt gebruikt om de API/MCP‑toegangsrechten te bepalen. De maximale toegangsrol voor deze (technische) gebruiker is beperkt tot "Bewerker". "Moderators" en "Beheerders" krijgen geen toegang bij API/MCP‑verzoeken.

source: If new records etc. are created with API/MCP, the data is created with the specified (technical) user. In order to have control about the changed data, it is not allowed that the selected (technical) user has "Automatically accept changes" activated. This ensures that a moderator can always reject unintended changes during a review of pending changes.
ca: Si es creen nous registres, etc., mitjançant l'API/MCP, les dades es creen amb l'usuari (tècnic) especificat. Per tenir control sobre les dades modificades, no està permès que l'usuari (tècnic) seleccionat tingui activada l'opció «Acceptar automàticament els canvis». Això garanteix que un moderador sempre pugui rebutjar canvis no desitjats durant la revisió dels canvis pendents.
de: Werden neue Datensätze etc. über API/MCP erstellt, dann werden diese Daten mit dem angegebenen (technischen) Benutzer angelegt. Um die Kontrolle über die geänderten Daten zu gewährleisten, darf die Option „Änderungen automatisch übernehmen“ für den ausgewählten (technischen) Benutzer nicht aktiviert sein. Dadurch kann ein Moderator unbeabsichtigte Änderungen mit Hilfe der Überprüfung von ausstehenden Änderungen jederzeit ablehnen.
es: Si se crean nuevos registros, etc. con API/MCP, los datos se crean con el usuario (técnico) especificado. Para tener control sobre los datos modificados, no se permite que el usuario (técnico) seleccionado tenga activada la opción «Aceptar cambios automáticamente». Esto garantiza que un moderador siempre pueda rechazar cambios no deseados durante la revisión de los cambios pendientes.
nl: Als nieuwe records en dergelijke via API/MCP worden aangemaakt, worden de gegevens aangemaakt met de opgegeven (technische) gebruiker. Om controle te hebben over de gewijzigde gegevens, is het niet toegestaan dat de geselecteerde (technische) gebruiker "Wijzigingen automatisch accepteren" heeft geactiveerd. Dit zorgt ervoor dat een moderator onbedoelde wijzigingen altijd kan afwijzen tijdens een beoordeling van in behandeling zijnde wijzigingen.

source: Create new keys
de: Neue Schlüssel erzeugen
